cases/flowCaseOldBC/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Guimaraes small domain -- RECENTRED frame       |
|    \\/     M anipulation  | simpleFoam wind precursor                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

// Freestream omega = sqrt(k)/(Cmu^0.25 * L), k~0.05, L~5 m -> ~0.08.
// Tune with k if the representative wind speed changes.
internalField   uniform 0.1;

boundaryField
{
    inletOutlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }

    top         { type symmetry; }

    Terrain     { type omegaWallFunction; value uniform 0.1; }
    Buildings   { type omegaWallFunction; value uniform 0.1; }
}


// ************************************************************************* //
