cases/flowCaseOldBC/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p   { solver GAMG; smoother GaussSeidel; tolerance 1e-7; relTol 0.05; }
    Phi { solver GAMG; smoother DIC;         tolerance 1e-6; relTol 0.01; }
    "(U|k|omega)" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0.1; }
}
SIMPLE
{
    consistent               no;
    nNonOrthogonalCorrectors 2;
    pRefCell                 0;
    pRefValue                0;
    residualControl { p 1e-4; U 1e-4; "(k|omega)" 1e-4; }
}
potentialFlow { nNonOrthogonalCorrectors 10; PhiRefCell 0; PhiRefValue 0; }
relaxationFactors
{
    fields    { p 0.3; }
    equations { U 0.5; "(k|omega)" 0.5; }
}
// ************************************************************************* //
